# sqwrl
### Sqlachemy Query WRapper Library
For an alternative, see also - https://pythonhosted.org/ibmdbpy/frame.html

In [1]:
import pandas as pd
import sqlalchemy as sa
from sqwrl import DB
from importlib import reload

/home/metaperture/.miniconda/envs/mvst/lib/python3.7/site-packages/odo/backends/pandas.py:102: FutureWarning: pandas.tslib is deprecated and will be removed in a future version.
You can access NaTType as type(pandas.NaT)
  @convert.register((pd.Timestamp, pd.Timedelta), (pd.tslib.NaTType, type(None)))

In [2]:

from importlib import reload
import sqwrl; reload(sqwrl)
from sqwrl import DB
db = DB('sqlite:///:memory:')
# verbose=True for SQLAlchemy echo output
# by default only checks validity during ipython interactive mode

In [3]:
df = pd.DataFrame({"x": [1,2,3,4,5], "y": list("abcdf"), "z": [1.0, 1.5, 1.5, 1.2, 1.3]}).set_index("y")

In [4]:
list(db)

[]

In [5]:
df["z"] - df["x"]

y
a    0.0
b   -0.5
c   -1.5
d   -2.8
f   -3.7
dtype: float64

In [6]:
df.sort_index()

   x    z
y
a  1  1.0
b  2  1.5
c  3  1.5
d  4  1.2
f  5  1.3

In [7]:
df.sort_values(df["z"] - df["x"])

KeyError: y
a    0.0
b   -0.5
c   -1.5
d   -2.8
f   -3.7
dtype: float64

In [8]:
db["test"] = df
tbl = db["test"]
tbl

In [9]:
df.join(df, lsuffix="l", rsuffix="r")

   xl   zl  xr   zr
y
a   1  1.0   1  1.0
b   2  1.5   2  1.5
c   3  1.5   3  1.5
d   4  1.2   4  1.2
f   5  1.3   5  1.3

In [10]:
tj = tbl.join(tbl, lsuffix="l", rsuffix="r")

In [11]:
tj.df

   y  x    z  y  x    z
0  a  1  1.0  a  1  1.0
1  b  2  1.5  b  2  1.5
2  c  3  1.5  c  3  1.5
3  d  4  1.2  d  4  1.2
4  f  5  1.3  f  5  1.3

In [12]:
tj._coldata[0].table

In [13]:
tbl["x"].loc[["a", "d"]]

y
a    1
d    4
Name: x, dtype: int64

In [11]:
tbl.index

In [12]:
db.tables

['test']

In [13]:
tbl.df == df

      x     z
y
a  True  True
b  True  True
c  True  True
d  True  True
f  True  True

In [14]:
tbl[["z", "x"]].iloc[1:-2].df

     z  x
y
b  1.5  2
c  1.5  3

In [15]:
tbl.sort_values(tbl["z"] - tbl["x"]).df

   x    z
y
f  5  1.3
d  4  1.2
c  3  1.5
b  2  1.5
a  1  1.0

In [16]:
tbl.sort_index(ascending=False).df

   x    z
y
f  5  1.3
d  4  1.2
c  3  1.5
b  2  1.5
a  1  1.0

In [17]:
tbl.sort_values(["z", "x"]).df

   x    z
y
a  1  1.0
b  2  1.5
c  3  1.5
d  4  1.2
f  5  1.3

In [22]:
expr = tbl.index

In [20]:
tbl.loc["a"]

x    1.0
z    1.0
Name: a, dtype: float64

In [19]:
tbl.loc[["a", "c"]]

     x    z
a  1.0  1.0
c  3.0  1.5

In [259]:
tbl["x"].s

y
a    1
b    2
c    3
d    4
f    5
Name: x, dtype: int64

In [352]:
tbl.set_index("x", append=True)["z"].s

y  x
a  1    1.0
b  2    1.5
c  3    1.5
d  4    1.2
f  5    1.3
Name: z, dtype: float64

In [351]:
tbl.df.loc["f"]

x    5.0
z    1.3
Name: f, dtype: float64

In [262]:
tbl.index

In [263]:
tbl.index.name = "ix"

In [343]:
tbl.set_index("x", drop=False).df

   x    z
x
1  1  1.0
2  2  1.5
3  3  1.5
4  4  1.2
5  5  1.3

In [344]:
tbl.set_index("x", append=True).df

       z
y x
a 1  1.0
b 2  1.5
c 3  1.5
d 4  1.2
f 5  1.3

In [23]:
tbl.set_index("x", append=True).df

        z
ix x
a  1  1.0
b  2  1.5
c  3  1.5
d  4  1.2
f  5  1.3

In [24]:
tbl.reset_index()["ix"].s

0    a
1    b
2    c
3    d
4    f
Name: ix, dtype: object

In [354]:
tbl.sort_values("z")[:3].df

   x    z
y
a  1  1.0
d  4  1.2
f  5  1.3

In [355]:
len(tbl)

5

In [14]:
df["x"].dtype

dtype('int64')

In [15]:
type(_)

numpy.dtype

In [356]:
tbl.dtypes

['int64', 'float64']

In [1]:
tbl["x"].dtype

NameError: name 'tbl' is not defined

In [358]:
(tbl["x"] < 3).s

y
a     True
b     True
c    False
d    False
f    False
Name: x, dtype: bool

In [359]:
len(tbl[tbl["x"] < 3])

2

In [360]:
tbl[tbl["x"] < 3].df

   x    z
y
a  1  1.0
b  2  1.5

In [361]:
tbl["z"].s

y
a    1.0
b    1.5
c    1.5
d    1.2
f    1.3
Name: z, dtype: float64

In [363]:
(tbl["x"] >= tbl["z"] * 2 * 2 / 3).s

y
a    False
b     True
c     True
d     True
f     True
Name: x, dtype: bool

In [362]:
tbl["x"].s

y
a    1
b    2
c    3
d    4
f    5
Name: x, dtype: int64

In [364]:
(tbl["x"] > tbl["z"]).s

y
a    False
b     True
c     True
d     True
f     True
Name: x, dtype: bool

In [365]:
tbl[tbl["x"] > 2]["x"].s

y
c    3
d    4
f    5
Name: x, dtype: int64

In [366]:
tbl[tbl["x"] > 2]["x"][tbl["x"] < 5].s

y
c    3
d    4
Name: x, dtype: int64

In [367]:
tbl["x"][tbl["x"] > tbl["z"]].s

y
b    2
c    3
d    4
f    5
Name: x, dtype: int64

In [368]:
tbl.df

   x    z
y
a  1  1.0
b  2  1.5
c  3  1.5
d  4  1.2
f  5  1.3

In [369]:
tbl[(tbl["x"] > 4) | (tbl["z"] >= 1.4)].df

   x    z
y
b  2  1.5
c  3  1.5
f  5  1.3

In [378]:
tbl["a"]

KeyError: "key 'a' not found among ['x', 'z']"

In [371]:
tbl.sort_values(["x", "z"]).df

   x    z
y
a  1  1.0
d  4  1.2
f  5  1.3
b  2  1.5
c  3  1.5

In [372]:
tbl["x"].loc["a"]

1

## Aggregation

In [385]:
tbl.max()

x    5.0
z    1.5
dtype: float64

In [386]:
tbl[tbl["z"] > 1.4].mean()

x    2.5
z    1.5
dtype: float64

In [387]:
(tbl.max(axis=1) - tbl.min(axis=1)).s

y
a    0.0
b    0.5
c    1.5
d    2.8
f    3.7
Name: max, dtype: float64

In [388]:
tbl[tbl["x"] >= tbl["x"].mean()]["x"].min()

3

In [389]:
tbl.nunique()

x    5
z    4
dtype: int64

In [390]:
tbl[tbl["x"] < tbl["x"].mean()]["x"].nunique()

2

In [391]:
df.nunique()

x    5
z    4
dtype: int64

In [392]:
tbl.index.max()

'f'

In [393]:
tbl[tbl["z"].isin(tbl["x"] / 2.0)].df

/home/metaperture/miniconda3/envs/std/lib/python3.6/site-packages/sqlalchemy/sql/sqltypes.py:596: SAWarning: Dialect sqlite+pysqlite does *not* support Decimal objects natively, and SQLAlchemy must convert from floating point - rounding errors and other issues may occur. Please consider storing Decimal numbers as strings or integers on this platform for lossless storage.
  'storage.' % (dialect.name, dialect.driver))

   x    z
y
a  1  1.0
b  2  1.5
c  3  1.5

In [394]:
tbl[tbl.index.isin(["c", "d"])].df

   x    z
y
c  3  1.5
d  4  1.2

In [395]:
tbl[tbl.index.startswith("a")].df

   x    z
y
a  1  1.0

In [396]:
tbl["x"].aggregate("all")

1

In [397]:
tbl[tbl["x"] != None].df

   x    z
y
a  1  1.0
b  2  1.5
c  3  1.5
d  4  1.2
f  5  1.3

In [398]:
df.max(axis=0)

x    5.0
z    1.5
dtype: float64

In [399]:
tbl["x"].head(2).s

y
a    1
b    2
Name: x, dtype: int64

## groupby ...

In [94]:
df2 = pd.DataFrame({"x": [1,2,3,4,5], "y": list("aaccg"), "z": [1.0, 1.5, 1.5, 1.2, 1.3], "w": list("ABBDD")}).set_index("x")
df2

   w  y    z
x
1  A  a  1.0
2  B  a  1.5
3  B  c  1.5
4  D  c  1.2
5  D  g  1.3

In [133]:
import sqwrl; reload(sqwrl)
from sqwrl import DB
db = DB('sqlite:///:memory:', verbose=True)
db["test2"] = df2
tbl2 = db["test2"]
db["test"] = df
tbl = db["test"]

2018-07-06 16:26:48,646 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2018-07-06 16:26:48,650 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,652 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2018-07-06 16:26:48,653 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,654 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2018-07-06 16:26:48,655 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,658 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("test2")
2018-07-06 16:26:48,660 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,662 INFO sqlalchemy.engine.base.Engine
CREATE TABLE test2 (
	x BIGINT NOT NULL,
	w VARCHAR,
	y VARCHAR,
	z FLOAT,
	PRIMARY KEY (x)
)


2018-07-06 16:26:48,663 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,664 INFO sqlalchemy.engine.base.Engine COMMIT
2018-07-06 16:26:48,665 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2018-07-06 16:26:48,667 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,668 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("test2")
2018-07-06 16:26:48,669 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,672 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test2' AND type = 'table'
2018-07-06 16:26:48,673 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,674 INFO sqlalchemy.engine.base.Engine PRAGMA foreign_key_list("test2")
2018-07-06 16:26:48,675 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,677 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test2' AND type = 'table'
2018-07-06 16:26:48,678 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,679 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("test2")
2018-07-06 16:26:48,680 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,682 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("test2")
2018-07-06 16:26:48,683 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,685 INFO sqlalchemy.engine.base.Engine PRAGMA index_info("sqlite_autoindex_test2_1")
2018-07-06 16:26:48,686 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,688 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test2' AND type = 'table'
2018-07-06 16:26:48,689 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,693 INFO sqlalchemy.engine.base.Engine INSERT INTO test2 (x, w, y, z) VALUES (?, ?, ?, ?)
2018-07-06 16:26:48,697 INFO sqlalchemy.engine.base.Engine ((1, 'A', 'a', 1.0), (2, 'B', 'a', 1.5), (3, 'B', 'c', 1.5), (4, 'D', 'c', 1.2), (5, 'D', 'g', 1.3))
2018-07-06 16:26:48,699 INFO sqlalchemy.engine.base.Engine COMMIT
2018-07-06 16:26:48,701 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2018-07-06 16:26:48,702 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,704 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("test2")
2018-07-06 16:26:48,705 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,708 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test2' AND type = 'table'
2018-07-06 16:26:48,709 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,711 INFO sqlalchemy.engine.base.Engine PRAGMA foreign_key_list("test2")
2018-07-06 16:26:48,713 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,716 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test2' AND type = 'table'
2018-07-06 16:26:48,717 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,719 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("test2")
2018-07-06 16:26:48,721 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,723 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("test2")
2018-07-06 16:26:48,724 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,726 INFO sqlalchemy.engine.base.Engine PRAGMA index_info("sqlite_autoindex_test2_1")
2018-07-06 16:26:48,727 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,728 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test2' AND type = 'table'
2018-07-06 16:26:48,729 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,731 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2018-07-06 16:26:48,733 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,736 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("test")
2018-07-06 16:26:48,738 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,740 INFO sqlalchemy.engine.base.Engine
CREATE TABLE test (
	y VARCHAR NOT NULL,
	x BIGINT,
	z FLOAT,
	PRIMARY KEY (y)
)


2018-07-06 16:26:48,743 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,748 INFO sqlalchemy.engine.base.Engine COMMIT
2018-07-06 16:26:48,749 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2018-07-06 16:26:48,751 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,753 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("test")
2018-07-06 16:26:48,755 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,757 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test' AND type = 'table'
2018-07-06 16:26:48,759 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,761 INFO sqlalchemy.engine.base.Engine PRAGMA foreign_key_list("test")
2018-07-06 16:26:48,763 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,767 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test' AND type = 'table'
2018-07-06 16:26:48,769 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,770 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("test")
2018-07-06 16:26:48,772 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,774 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("test")
2018-07-06 16:26:48,776 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,777 INFO sqlalchemy.engine.base.Engine PRAGMA index_info("sqlite_autoindex_test_1")
2018-07-06 16:26:48,778 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,780 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test' AND type = 'table'
2018-07-06 16:26:48,781 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,786 INFO sqlalchemy.engine.base.Engine INSERT INTO test (y, x, z) VALUES (?, ?, ?)
2018-07-06 16:26:48,788 INFO sqlalchemy.engine.base.Engine (('a', 1.0, 1.0), ('b', 2.0, 1.5), ('c', 3.0, 1.5), ('d', 4.0, 1.2), ('f', 5.0, 1.3))
2018-07-06 16:26:48,789 INFO sqlalchemy.engine.base.Engine COMMIT
2018-07-06 16:26:48,790 INFO sqlalchemy.engine.base.Engine SELECT name FROM sqlite_master WHERE type='table' ORDER BY name
2018-07-06 16:26:48,792 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,794 INFO sqlalchemy.engine.base.Engine PRAGMA table_info("test")
2018-07-06 16:26:48,795 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,797 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test' AND type = 'table'
2018-07-06 16:26:48,799 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,800 INFO sqlalchemy.engine.base.Engine PRAGMA foreign_key_list("test")
2018-07-06 16:26:48,802 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,803 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test' AND type = 'table'
2018-07-06 16:26:48,805 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,807 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("test")
2018-07-06 16:26:48,808 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,810 INFO sqlalchemy.engine.base.Engine PRAGMA index_list("test")
2018-07-06 16:26:48,811 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,812 INFO sqlalchemy.engine.base.Engine PRAGMA index_info("sqlite_autoindex_test_1")
2018-07-06 16:26:48,813 INFO sqlalchemy.engine.base.Engine ()
2018-07-06 16:26:48,815 INFO sqlalchemy.engine.base.Engine SELECT sql FROM  (SELECT * FROM sqlite_master UNION ALL   SELECT * FROM sqlite_temp_master) WHERE name = 'test' AND type = 'table'
2018-07-06 16:26:48,816 INFO sqlalchemy.engine.base.Engine ()

In [96]:
tbl

In [107]:
tbl2.set_index("y")

In [98]:
tbl.columns

['x', 'z']

In [121]:
tbl2._ixdata

[Column('x', BIGINT(), table=<test2>, primary_key=True, nullable=False)]

In [130]:
tbl.reset_index()

2018-07-06 16:24:10,193 INFO sqlalchemy.engine.base.Engine SELECT test.x, test.z, test.y
FROM test
 LIMIT ? OFFSET ?
2018-07-06 16:24:10,195 INFO sqlalchemy.engine.base.Engine (5, 0)
2018-07-06 16:24:10,199 INFO sqlalchemy.engine.base.Engine SELECT count(*) AS count_1
FROM test
2018-07-06 16:24:10,200 INFO sqlalchemy.engine.base.Engine ()

In [132]:
tbl.reset_index().join(tbl2, on="y", lsuffix="l").df

['z', 'w', 'z'] ['x', 'zl', 'yl', 'w', 'y', 'z']
2018-07-06 16:24:34,170 INFO sqlalchemy.engine.base.Engine SELECT test_1.y, test_1.z, test2_1.w, test2_1.z
FROM test AS test_1 LEFT OUTER JOIN test2 AS test2_1 ON test_1.y = test2_1.y
2018-07-06 16:24:34,171 INFO sqlalchemy.engine.base.Engine ()

     z     w    z
y
a  1.0     A  1.0
a  1.0     B  1.5
b  1.5  None  NaN
c  1.5     B  1.5
c  1.5     D  1.2
d  1.2  None  NaN
f  1.3  None  NaN

In [129]:
tbl.join(tbl2.set_index("y"), how="right", lsuffix="l").df

['w', 'z', 'z'] ['w', 'z', 'x', 'zl']
2018-07-06 16:23:30,239 INFO sqlalchemy.engine.base.Engine SELECT test2_1.x, test2_1.w, test2_1.z, test_1.z
FROM test2 AS test2_1 LEFT OUTER JOIN test AS test_1 ON test2_1.y = test_1.y
2018-07-06 16:23:30,241 INFO sqlalchemy.engine.base.Engine ()

   w    z    z
x
1  A  1.0  1.0
2  B  1.5  1.0
3  B  1.5  1.5
4  D  1.2  1.5
5  D  1.3  NaN

In [70]:
tbl

In [71]:
tbl2

In [74]:
tbl.join(tbl2.set_index("y"), lsuffix="l")

AssertionError:

In [805]:
gb = df2.groupby(df2["y"], as_index=False)

In [806]:
gb_sa = tbl2.groupby(tbl2["y"], as_index=False)

In [759]:
gb.sum()

   y    z
0  a  2.5
1  c  2.7
2  f  1.3

In [807]:
vt = gb_sa.agg("count", as_df=False)

In [797]:
vt.__dict__

{'_coldata': [<sqlalchemy.sql.elements.ColumnClause at 0x7f4368f7dba8; %(139927522574632 count)s>,
  <sqlalchemy.sql.elements.ColumnClause at 0x7f4368f7deb8; %(139927512106096 count)s>,
  <sqlalchemy.sql.elements.ColumnClause at 0x7f4368f78208; %(139927506581096 count)s>],
 '_columns': ['w', 'y', 'z'],
 '_from_i': None,
 '_ix': ['y'],
 '_ixdata': [Column('y', VARCHAR(), table=<Select object>)],
 '_sort_by': [],
 '_to_i': None,
 '_whereclause': None,
 'engine': Engine(sqlite:///:memory:),
 'sa': <sqlalchemy.sql.selectable.Select at 0x7f4368f7d2e8; Select object>,
 'sa_columns': <sqlalchemy.sql.base.ImmutableColumnCollection at 0x7f4368f8caf8>}

In [798]:
len(vt)

3

In [809]:
(vt["w"] + vt["z"]).s

2018-07-02 23:28:04,357 INFO sqlalchemy.engine.base.Engine SELECT y, count_1 + count_2 AS anon_1
FROM (SELECT test2.y AS y, count(test2.w) AS count_1, count(test2.y) AS count_3, count(test2.z) AS count_2
FROM test2 GROUP BY test2.y ORDER BY test2.y)
2018-07-02 23:28:04,359 INFO sqlalchemy.engine.base.Engine ()

y
a    4
c    4
f    2
Name: w, dtype: int64

In [775]:
tbl2

In [773]:
len(tbl2)

5

In [810]:
vt

2018-07-02 23:29:53,213 INFO sqlalchemy.engine.base.Engine SELECT y, count_1, count_2, count_3
FROM (SELECT test2.y AS y, count(test2.w) AS count_1, count(test2.y) AS count_2, count(test2.z) AS count_3
FROM test2 GROUP BY test2.y ORDER BY test2.y)
 LIMIT ? OFFSET ?
2018-07-02 23:29:53,221 INFO sqlalchemy.engine.base.Engine (5, 0)
2018-07-02 23:29:53,247 INFO sqlalchemy.engine.base.Engine SELECT count(*) AS count_1
FROM (SELECT test2.y AS y, count(test2.w) AS count_2, count(test2.y) AS count_3, count(test2.z) AS count_4
FROM test2 GROUP BY test2.y ORDER BY test2.y)
2018-07-02 23:29:53,253 INFO sqlalchemy.engine.base.Engine ()

In [713]:
gb_sa.sum()

   y    z
0  a  2.5
1  c  2.7
2  f  1.3

In [714]:
tbl2.index

In [715]:
tbl2.sort_values("y")["y"].distinct().s

0    a
1    c
2    f
Name: y, dtype: object

In [716]:
tbl2.sort_values(tbl2["y"])["y"].distinct().s

0    a
1    c
2    f
Name: y, dtype: object

In [717]:
tbl2["y"].sa

Column('y', VARCHAR(), table=<test2>)

In [718]:
import collections

In [624]:
list(df.iterrows())

[('a', x    1.0
  z    1.0
  Name: a, dtype: float64), ('b', x    2.0
  z    1.5
  Name: b, dtype: float64), ('c', x    3.0
  z    1.5
  Name: c, dtype: float64), ('d', x    4.0
  z    1.2
  Name: d, dtype: float64), ('f', x    5.0
  z    1.3
  Name: f, dtype: float64)]

In [625]:
list(df.values)

[array([ 1.,  1.]),
 array([ 2. ,  1.5]),
 array([ 3. ,  1.5]),
 array([ 4. ,  1.2]),
 array([ 5. ,  1.3])]

In [626]:
list(tbl2.sa_columns)

[Column('x', BIGINT(), table=<test2>, primary_key=True, nullable=False),
 Column('w', VARCHAR(), table=<test2>),
 Column('y', VARCHAR(), table=<test2>),
 Column('z', FLOAT(), table=<test2>)]

In [627]:
tbl2[tbl2['y'] == 'a']

In [628]:
repr(tbl2['y'] == 'a')

'<Expression(<sqlalchemy.sql.elements.BinaryExpression object at 0x7f436a61e780>)>'

In [629]:
df2.groupby(["y", "z"]).groups

{('a', 1.0): Int64Index([1], dtype='int64', name='x'),
 ('a', 1.5): Int64Index([2], dtype='int64', name='x'),
 ('c', 1.2): Int64Index([4], dtype='int64', name='x'),
 ('c', 1.5): Int64Index([3], dtype='int64', name='x'),
 ('f', 1.3): Int64Index([5], dtype='int64', name='x')}

In [631]:
for g, subdf in df2.groupby("y"):
    print(g, repr(subdf))
    display(subdf)

a    w  y    z
x
1  A  a  1.0
2  B  a  1.5

   w  y    z
x
1  A  a  1.0
2  B  a  1.5

c    w  y    z
x
3  B  c  1.5
4  D  c  1.2

   w  y    z
x
3  B  c  1.5
4  D  c  1.2

f    w  y    z
x
5  D  f  1.3

   w  y    z
x
5  D  f  1.3

In [512]:
for g, subdf in tbl2.groupby("y"):
    print(g, repr(subdf))
    display(subdf)

a <sqwrl.Table object at 0x7f436a372400>

a <sqwrl.Table object at 0x7f436a37a518>

c <sqwrl.Table object at 0x7f436a37a240>

c <sqwrl.Table object at 0x7f436a396400>

f <sqwrl.Table object at 0x7f436a38b9b0>

In [516]:
len(gb)

3

In [632]:
len(gb_sa)

3

In [633]:
gb.groups

{'a': Int64Index([1, 2], dtype='int64', name='x'),
 'c': Int64Index([3, 4], dtype='int64', name='x'),
 'f': Int64Index([5], dtype='int64', name='x')}

In [634]:
gb_sa.groups

{'a': <sqlalchemy.sql.elements.BinaryExpression object at 0x7f4369c811d0>,
 'c': <sqlalchemy.sql.elements.BinaryExpression object at 0x7f436a7be710>,
 'f': <sqlalchemy.sql.elements.BinaryExpression object at 0x7f4369c744e0>}

In [635]:
df2.dtypes

w     object
y     object
z    float64
dtype: object

In [636]:
gb.sum()

   y    z
0  a  2.5
1  c  2.7
2  f  1.3

In [637]:
tbl2.dtypes

['string', 'string', 'float64']

In [638]:
gb.aggregate("mean")

   y     z
0  a  1.25
1  c  1.35
2  f  1.30

In [639]:
gb_sa.aggregate("mean")

   y     z
0  a  1.25
1  c  1.35
2  f  1.30

In [640]:
for g, subdf in df2.groupby("y", sort=False, as_index=False):
    print(g, "\n", subdf)

a
    w  y    z
x
1  A  a  1.0
2  B  a  1.5
c
    w  y    z
x
3  B  c  1.5
4  D  c  1.2
f
    w  y    z
x
5  D  f  1.3

In [33]:
gb.transform(lambda x: x)

   w    z
x
1  A  1.0
2  B  1.5
3  B  1.5
4  D  1.2
5  D  1.3

In [643]:
for a, b in df2["z"].groupby(df2["y"]):
    print(repr(a), ":", b)

'a' : x
1    1.0
2    1.5
Name: z, dtype: float64
'c' : x
3    1.5
4    1.2
Name: z, dtype: float64
'f' : x
5    1.3
Name: z, dtype: float64

In [644]:
for a, b in tbl2["z"].groupby(tbl2["y"]):
    print(repr(a), ":", b.s)

'a' : x
1    1.0
2    1.5
Name: z, dtype: float64
'c' : x
3    1.5
4    1.2
Name: z, dtype: float64
'f' : x
5    1.3
Name: z, dtype: float64

In [645]:
df2.groupby("y")["z"].sum() # min / max / mean

y
a    2.5
c    2.7
f    1.3
Name: z, dtype: float64

In [646]:
tbl2.groupby("y")["z"].sum() # min / max / mean

y
a    2.5
c    2.7
f    1.3
Name: z, dtype: float64

In [647]:
df2.groupby(["y", "w"])["z"].sum() # min / max / mean

y  w
a  A    1.0
   B    1.5
c  B    1.5
   D    1.2
f  D    1.3
Name: z, dtype: float64

In [649]:
df2.groupby(["y", "w"])["z"].sum() # min / max / mean

y  w
a  A    1.0
   B    1.5
c  B    1.5
   D    1.2
f  D    1.3
Name: z, dtype: float64

In [27]:
df2.groupby(["y", "w"], sort=True)["z"].sum() # min / max / mean

y  w
a  A    1.0
   B    1.5
c  B    1.5
   D    1.2
f  D    1.3
Name: z, dtype: float64

In [591]:
tbl2.groupby(["y", "w"], sort=True)["z"].sum() # min / max / mean

   y  w    z
0  a  A  1.0
1  a  B  1.5
2  c  B  1.5
3  c  D  1.2
4  f  D  1.3

In [659]:
tbl2.groupby(["w"]).get_group("B")

In [29]:
df2.groupby(["w"]).get_group("B")

   w  y    z
x
2  B  a  1.5
3  B  c  1.5

In [660]:
df2.groupby("w").groups

{'A': Int64Index([1], dtype='int64', name='x'),
 'B': Int64Index([2, 3], dtype='int64', name='x'),
 'D': Int64Index([4, 5], dtype='int64', name='x')}

In [663]:
df2

   w  y    z
x
1  A  a  1.0
2  B  a  1.5
3  B  c  1.5
4  D  c  1.2
5  D  f  1.3

In [673]:
tbl2.groupby('w')['z'].__dict__ == tbl2['z'].groupby(tbl2['w']).__dict__

True

In [719]:
tbl2.groupby("y").size()

y
a    2
c    2
f    1
dtype: int64

In [721]:
tbl2.groupby("y").sum()

     z
y
a  2.5
c  2.7
f  1.3

In [720]:
df2.groupby("y").sum()

     z
y
a  2.5
c  2.7
f  1.3

In [430]:
df2.groupby("y").size()

y
a    2
c    2
f    1
dtype: int64

```Function 	Description
mean() 	Compute mean of groups
sum() 	Compute sum of group values
size() 	Compute group sizes
count() 	Compute count of group
std() 	Standard deviation of groups
var() 	Compute variance of groups
sem() 	Standard error of the mean of groups
describe() 	Generates descriptive statistics
first() 	Compute first of group values
last() 	Compute last of group values
nth() 	Take nth value, or a subset if n is a list
min() 	Compute min of group values
max() 	Compute max of group values
cumcount()  basically like an ordered rank
ngroup()  the group number, kind of like categorical codes```

In [725]:
df2.groupby("y").aggregate(["sum", "mean", "std"])

     z
   sum  mean       std
y
a  2.5  1.25  0.353553
c  2.7  1.35  0.212132
f  1.3  1.30       NaN

In [726]:
tbl2.groupby("y").aggregate(["sum", "mean", "std"])

TypeError: unhashable type: 'list'

In [727]:
df2.groupby("y").agg({"z": "mean", "w": "sum"})

      z   w
y
a  1.25  AB
c  1.35  BD
f  1.30   D

In [729]:
tbl2.groupby("y").aggregate({"z": "mean", "w": "sum"})

TypeError: unhashable type: 'dict'

## groupby todo:
 - multiindex, levels
 - transform
 - filter
 - apply
 - groupers

In [24]:
tbl2.df

   w  y    z
x
1  A  a  1.0
2  B  a  1.5
3  B  c  1.5
4  D  c  1.2
5  D  f  1.3

## joins ...

## To do:
 + schema: .columns, .dtype
 + len
 + from pd, to pd
   - append, delitem, setitem
 + column expressions
 + where via getitem (incl expr where)
 + slicing (getitme, islice, iloc)
   - complicated slicing stuff (e.g. where, sort, etc.)
     - subtable...do during joins
   - better combination / method stacking
 + sort_values
   + [::-1] reverses sort order...
     - should change slice limits?
     - custom reversed method...
   - row id for noindex?
   + sort by expression
   + multicol sorting
   + ascending list
   + sort memory
   + expression sorting (e.g. to get col k-max)
 + indexing
   + index <=> primary key
   + .loc -> index fetch
   + index in series get (incl multiindex)
   + Expression.loc
   + .loc[select, columns]
 - write
   - db delitem, setitem
   - append, insert
   - new columns
   - .loc / .iloc setter

 + subselect columns
   + column rename
   + series multiindex

 - aggregation
   + basic functions
   - split-apply-combine

 - joins

 - inplace option?

## appendix

In [ ]:
opmap = {
    sympy.add.Add: lambda *x: sum(x),
    sympy.mul.Mul: operator.mul,
    sympy.power.Pow: operator.pow,
    sympy.relational.Lt: operator.lt,
    sympy.relational.Gt: operator.gt,
    sympy.relational.Le: operator.le,
    sympy.relational.Ge: operator.ge,
    sympy.relational.Eq: operator.eq,
    sympy.relational.Ne: operator.ne,
    sympy.boolalg.And: sa.and_,
    sympy.boolalg.Or: sa.or_,
}

def sympy_op_sub(expr, subs):
    if isinstance(expr, sympy.symbol.Symbol):
        return subs[expr]
    if isinstance(expr, sympy.numbers.Integer):
        return int(expr)
    elif isinstance(expr, sympy.numbers.Number):
        return float(expr)
    for k, v in opmap.items():
        if isinstance(expr, k):
            args = [sympy_op_sub(arg, subs) for arg in expr.args]
            return v(*args)
    else:
        raise ValueError("unrecognized operation: %s" % type(expr))